Revit 2027 API
BuiltInFailures.MEPCalculationFailures.PipePressureDropCalculatorNotAvailable Property
 Pipe Pressure Drop Calculator Not Available: [Calculator Name]
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId PipePressureDropCalculatorNotAvailable { get; }
Public Shared ReadOnly Property PipePressureDropCalculatorNotAvailable As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ PipePressureDropCalculatorNotAvailable {
	FailureDefinitionId^ get ();
}
static member PipePressureDropCalculatorNotAvailable : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.MEPCalculationFailures Class
Autodesk.Revit.DB Namespace